driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSWSDLSymmetryTest_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jms="http://j2ee.netbeans.org/wsdl/JMSWSDLSymmetryTestDriver">
  <soapenv:Body>
    <jms:part1>This test is to ensure that the JMS BC endpoint is bidirectionally symmetric</jms:part1>
    <jms:part2>FOO.Type</jms:part2>
  </soapenv:Body>
</soapenv:Envelope>